# =🚩Sentences marker

External linkage pertains to entities declared extern, functions, class types 
and their members (including static members), and variables, and all templates 
thereof, that are not already internal by the rules above, and all enums. 

This sounds very esoteric, so let’s pin it down with some concrete examples:


# =🚩 Big forest
- [初识 Rust](https://wudaijun.com/2020/02/rust-basic/)
- [Cppreference Archives](https://en.cppreference.com/w/Cppreference:Archives)
- [C++ Quick Guide](https://www.tutorialspoint.com/cplusplus/cpp_quick_guide.htm)
- [Visual Studio 2019 C++ 语言文档](https://docs.microsoft.com/zh-cn/cpp/cpp/)
- [欢迎回到新式 C++](https://docs.microsoft.com/zh-cn/cpp/cpp/welcome-back-to-cpp-modern-cpp)
- [C++11 - the new ISO C++ standard](https://www.stroustrup.com/C++11FAQ.html)
- [C++17 features, Tony Tables](https://github.com/tvaneerd/cpp17_in_TTs/blob/main/ALL_IN_ONE.md)
- [重读 The C Programming Language](https://zhuanlan.zhihu.com/p/379408556)
- Writing Compilers and Interpreters: A Modern Software Engineering Approach Using Java
- [CS106B Programming Abstractions (C++)](https://web.stanford.edu/class/cs106b/)
- [CS107 Computer Organization & Systems (C)](https://web.stanford.edu/class/cs107/)

面向对象编程的四大特征：

✔ `抽象` Abstraction 类与对象体现了 C++ 的抽象特征，即类是对象的抽象，对象是类的具体表现形式。
✔ `封装` Encapsulation 封装意味着对象只向外部世界提供有限的接口，隐藏对象的内部状态和实现细节。
✔ `继承` Reuse 重用类的继承与派生体现了 C++ 的继承特性。
✔ `多态` Polymorphism 类的虚函数体现了 C++ 的多态性。

类与对象的数据成员、函数成员，以及数据成员和函数成员的公用、私有和保护特性体现了 C++ 的封装特性，

    virtual ~HumanBeing() {}
};
```

- FAQ 21.14 How can the compiler be kept from generating duplicate outlined copies of inline virtual functions?

如果类具有一个或多个虚函数，继承的或在该类中声明的，则该类应至少具有一个非内联虚拟函数。许多编译器使用第一个非内联虚拟函数的位置来确定源文件，该文件将包含类的神奇内容（virtual table, out-lined copies of inline virtual functions）。如果类的所有虚拟函数都是内联定义的，那么这些编译器可能会在那些包含此类头文件的每个源文件中放置神奇内容的静态副本。

请注意，此建议对编译器相当敏感。一些编译器不会生成神奇内容的副本，即使类中的所有虚拟函数都是内联的。但即使在这些编译器中，也不需要花费太多的成本确保至少有一个类的虚拟函数是非内联的。

相比普通函数，调用虚函数的额外开销是不大的。实际上，几乎所有编译器都以相同的方式进行编译，并且开销非常小。并且在参数越多的情况下，越趋于相同，因为虚函数的动态绑定是恒定的开销。在极大的差别情况下，可能有 10% - 20% 的额外开销。


## ==⚡ Class Layout 类数据结构布局
- C++ vtables https://shaharmike.com/cpp/vtable-part1/
- Inside the C++ Object Model By Stanley B. Lippman, May 03, 1996
- the Virtual Table https://www.learncpp.com/cpp-tutorial/the-virtual-table/

类数据结构在内存布局上有两种策略，取决于编译器的实现，它们决定了虚函数表在内存中地址如何安排：

- Virtual Inheritance with Pointer Strategy
- Virtual Inheritance with Virtual Table Offset Strategy

根据使用的继承机制不同，编译器不实现差异，类数据内存布局明显有变化，主要包含了：

- vftable 虚函数表：包含虚函数的列表数据结构；
- vbtable 虚基类表：继承链上所有路径上共同的虚基类都通过一张表管理；
- vfptr 虚函数指针：指向虚函数表中的首条目；
- vbptr 虚基类指针：指向虚基类副本，在使用虚继承时产生；
- this adjustor 上下文指针调整：继承结构中，有各种类实例对象需要使用 this 指针来访问成员，根据进行偏移地址调整；

显然，创建类实例后，它就是按类结构存放在内存某个区块的数据结构，任意多的实例就有任意多的这些数据结构。但是类的结构是统一的，除了实例的数据，像成员函数、静态成员这些东西都是共用的。所以设置数据结构时，就需要使用一个 this 指针来指向这些数据，并且在实例数据所在要保留一个指针指向类的公共结构。当调用成员时，就根据数据找到到成员方法的地址，或者对于虚函数，就先通过虚函数表指针来定位。所以，虚函数表有时也被叫作 dispatch table，派发函数调用的表。调用成员方法时，this 指针作为第一个参数传入，供成员函数访问相应的实例数据。

以下示范代码中，表示了编译器隐含的操作，它会在顶层基类内存开始地址处放置一个虚函数表指针：

```C++,ignore
class Base
{
public:
    VirtualTable* __vptr;
    virtual void function1() {};
    virtual void function2() {};
};
```

在 MSVC 编译器中，一个类使用虚函数表方式如下，根据单一继承、多继承，和是否使用虚继承进行区别，这里只讨论两层继承：

- 非虚单继承，只要类本身或父类只要使用了虚函数，就需要使用一张虚函数表，表中条目按虚函数在类中的声明顺序排列，基类优先，包括私有的虚函数；
- 虚单一继承，只要类本身或父类只要使用了虚函数，都独立一张虚函数表管理，因没有其它基类，所以子类不用和其它非虚基类共用虚函数表。
- 非虚多继承，子类和首个使用了虚函数的基类共用虚函数表，其它基类使用独立虚函表，如果有使用虚函数；

虚拟多继承情形分开讨论，主要区别在于是否使用虚继承，如果使用虚继承，类本身和基类虚函数分表管理。所有可能存在的虚基类都通过一张 vbtable 表管理。

- 子类、基类都没有使用虚函数的虚继承很简单，只有 vbtable 来管理虚基类，没有虚函数表，因为不需要。
- 只在子类使用虚函数的情况，只有子类一张虚函数表。
- 只在基类使用虚函数的情况，根据使用了虚函数的基数在列表的顺序设置虚函数表。因为只会有一张 vbtable，只有在第一个虚继承的基类的虚函数表前放置，如果它有使用虚函数表。
- 子类、基类都有使用虚函数的情况，子类会和虚继承前面的基类共同同一张虚函数表，如果前面有使用了虚函数的基类。后继的基类按继承列表顺序设置虚函数表。会在第一个虚基类的虚函数表前会设置一张 vbtable，和其它虚基类共用。

在多层的虚拟继承结构中，vbtable 会有多张，取决于有多少层次深度，和虚继承关系数量。

各种现代编译都提供了打印 C++ 类对象数据内存布局的工具：

    cl.exe source.cpp /d1reportSingleClassLayout<CLASSNAME>
    cl.exe source.cpp /d1reportAllClassLayout
    gcc --fdump-class-hierarchy source.cpp
    clang -Xclang -fdump-record-layouts source.cpp

输出格式不一样，以 MSVC 编译器的输出为参考，将前面小节的示范类型层次结构打印出来，以下是没有虚继承时两层继承的内存布局：

    **********************************************************************
    ** Visual Studio 2019 Developer Command Prompt v16.6.1
    ** Copyright (c) 2020 Microsoft Corporation
    **********************************************************************
    [vcvarsall.bat] Environment initialized for: 'x64'
    用于 x64 的 Microsoft (R) C/C++ 优化编译器 19.26.28806 版
    版权所有(C) Microsoft Corporation。保留所有权利。

    class XMan  size(16):
        +---
     0  | +--- (base class MI)
     0  | | +--- (base class VMan1)
     0  | | | +--- (base class HumanBeing)
     0  | | | | {vfptr}
        | | | +---
        | | +---
     8  | | +--- (base class VMan2)
     8  | | | +--- (base class HumanBeing)
     8  | | | | {vfptr}
        | | | +---
        | | +---
        | +---
        +---

    XMan::$vftable@VMan1@:
        | &XMan_meta
        |  0
     0  | &MI::vf 
     1  | &XMan::{dtor} 

    XMan::$vftable@VMan2@:
        | -8
     0  | &thunk: this-=8; goto MI::vf 
     1  | &thunk: this-=8; goto XMan::{dtor} 

    XMan::{dtor} this adjustor: 0
    XMan::__delDtor this adjustor: 0
    XMan::__vecDelDtor this adjustor: 0

从打印出来的内存布局信息可以看到，HumanBeing 有两个副本对象。XMan 实例主体占 16-Byte，包含自身的数据成员和两个直接基类的数据成员。因为使用了虚函数，所以配置了相应的 Virtual Table，每个直接父类对应一个，使用 vfptr 指针引用。

包含纯虚函数的基类 HumanBeing 是抽象类，不能直接使用代码来实例化，所以 MSVC 没有打印相应的内存布局，只嵌入子类的内存布局中。

其它普通的类方法成员有专用的地址，不会在虚表中记录，也不会在对象的数据内存布局中记录。

特定情况可以看到虚函数表中有两个析构函数，在 MSVC 生成的内存布局信息中会用 deleting 和 complete 后缀标记，因为对象有两种构造方式，栈构造和堆构造。所以对应对象也有两种析构方式。差别在于，堆上对象的析构需要手动管理，而栈内存的对象析构不需要执行 delete 函数，编译器会自动处理回收问题。

以下是两层的虚继承的类数据结构，同时有两张 vbtable 对应两个直接基类的虚继承。最主要的是 HumanBeing 在内存中只有一个副本，这就是虚继承的设计的目的：

    class XMan  size(32):
        +---
     0  | +--- (base class MI)
     0  | | +--- (base class VMan1)
     0  | | | {vbptr}
        | | | <alignment member> (size=4)
        | | +---
     8  | | +--- (base class VMan2)
     8  | | | {vbptr}
        | | | <alignment member> (size=4)
        | | +---
        | | <alignment member> (size=4)
        | +---
        | <alignment member> (size=4)
        +---
    20  | (vtordisp for vbase HumanBeing)
        +--- (virtual base HumanBeing)
    24  | {vfptr}
        +---

    XMan::$vbtable@VMan1@:
     0  | 0
     1  | 24 (XMand(VMan1+0)HumanBeing)

    XMan::$vbtable@VMan2@:
     0  | 0
     1  | 16 (XMand(VMan2+0)HumanBeing)

    XMan::$vftable@:
        | -24
     0  | &(vtordisp) MI::vf 
     1  | &(vtordisp) XMan::{dtor} 

    XMan::{dtor} this adjustor: 24
    XMan::__delDtor this adjustor: 24
    XMan::__vecDelDtor this adjustor: 24
    vbi:       class  offset o.vbptr  o.vbte fVtorDisp
          HumanBeing      24       0       4 1

